<details>
<summary>Execution result of "plan" in "infra/live/dev"</summary>

```terraform
13:11:15.769 INFO   Downloading Terraform configurations from ../../modules/oppsamlingsregister into ./.terragrunt-cache/gHO2bkC8V1hV6NycyO9MtbQ7YTQ/WEFL1YLQrxAiSuZr6SmY62HRJms
13:11:15.790 INFO   tofu: Initializing the backend...
13:11:18.218 INFO   tofu: 
13:11:18.218 INFO   tofu: Successfully configured the backend "azurerm"! OpenTofu will automatically
13:11:18.218 INFO   tofu: use this backend unless the backend configuration changes.
13:11:19.639 INFO   tofu: Initializing provider plugins...
13:11:19.639 INFO   tofu: - Finding hashicorp/azurerm versions matching "~> 4.45"...
13:11:20.233 INFO   tofu: - Installing hashicorp/azurerm v4.45.1...
13:11:21.852 INFO   tofu: - Installed hashicorp/azurerm v4.45.1 (signed, key ID 0C0AF313E5FD9F80)
13:11:21.852 INFO   tofu: Providers are signed by their developers.
13:11:21.852 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
13:11:21.852 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
13:11:21.852 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
13:11:21.854 INFO   tofu: selections it made above. Include this file in your version control repository
13:11:21.854 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
13:11:21.854 INFO   tofu: you run "tofu init" in the future.
13:11:21.855 INFO   tofu: OpenTofu has been successfully initialized!
13:11:24.946 STDOUT tofu: Acquiring state lock. This may take a few moments...
13:11:34.420 STDOUT tofu: data.azurerm_resource_group.this: Reading...
13:11:35.472 STDOUT tofu: data.azurerm_resource_group.this: Read complete after 1s [id=/subscriptions/5d82c6f6-7f53-44ca-9723-63d16e4869d3/resourceGroups/rg-tf-oppsamlingsregister-dev]
13:11:35.514 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
13:11:35.514 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
13:11:35.514 STDOUT tofu:   + create
13:11:35.514 STDOUT tofu: OpenTofu will perform the following actions:
13:11:35.515 STDOUT tofu:   # azurerm_storage_account.this will be created
13:11:35.515 STDOUT tofu:   + resource "azurerm_storage_account" "this" {
13:11:35.515 STDOUT tofu:       + access_tier                        = (known after apply)
13:11:35.515 STDOUT tofu:       + account_kind                       = "StorageV2"
13:11:35.515 STDOUT tofu:       + account_replication_type           = "ZRS"
13:11:35.515 STDOUT tofu:       + account_tier                       = "Standard"
13:11:35.515 STDOUT tofu:       + allow_nested_items_to_be_public    = true
13:11:35.515 STDOUT tofu:       + cross_tenant_replication_enabled   = false
13:11:35.515 STDOUT tofu:       + default_to_oauth_authentication    = false
13:11:35.515 STDOUT tofu:       + dns_endpoint_type                  = "Standard"
13:11:35.516 STDOUT tofu:       + https_traffic_only_enabled         = true
13:11:35.516 STDOUT tofu:       + id                                 = (known after apply)
13:11:35.516 STDOUT tofu:       + infrastructure_encryption_enabled  = false
13:11:35.516 STDOUT tofu:       + is_hns_enabled                     = false
13:11:35.516 STDOUT tofu:       + large_file_share_enabled           = (known after apply)
13:11:35.516 STDOUT tofu:       + local_user_enabled                 = true
13:11:35.516 STDOUT tofu:       + location                           = "norwayeast"
13:11:35.516 STDOUT tofu:       + min_tls_version                    = "TLS1_2"
13:11:35.516 STDOUT tofu:       + name                               = "stoppsamregdev12740"
13:11:35.516 STDOUT tofu:       + nfsv3_enabled                      = false
13:11:35.516 STDOUT tofu:       + primary_access_key                 = (sensitive value)
13:11:35.516 STDOUT tofu:       + primary_blob_connection_string     = (sensitive value)
13:11:35.516 STDOUT tofu:       + primary_blob_endpoint              = (known after apply)
13:11:35.516 STDOUT tofu:       + primary_blob_host                  = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_blob_internet_endpoint     = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_blob_internet_host         = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_blob_microsoft_endpoint    = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_blob_microsoft_host        = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_connection_string          = (sensitive value)
13:11:35.517 STDOUT tofu:       + primary_dfs_endpoint               = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_dfs_host                   = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_dfs_internet_endpoint      = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_dfs_internet_host          = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_dfs_microsoft_endpoint     = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_dfs_microsoft_host         = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_file_endpoint              = (known after apply)
13:11:35.517 STDOUT tofu:       + primary_file_host                  = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_file_internet_endpoint     = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_file_internet_host         = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_file_microsoft_endpoint    = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_file_microsoft_host        = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_location                   = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_queue_endpoint             = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_queue_host                 = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_queue_microsoft_endpoint   = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_queue_microsoft_host       = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_table_endpoint             = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_table_host                 = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_table_microsoft_endpoint   = (known after apply)
13:11:35.518 STDOUT tofu:       + primary_table_microsoft_host       = (known after apply)
13:11:35.519 STDOUT tofu:       + primary_web_endpoint               = (known after apply)
13:11:35.519 STDOUT tofu:       + primary_web_host                   = (known after apply)
13:11:35.519 STDOUT tofu:       + primary_web_internet_endpoint      = (known after apply)
13:11:35.519 STDOUT tofu:       + primary_web_internet_host          = (known after apply)
13:11:35.519 STDOUT tofu:       + primary_web_microsoft_endpoint     = (known after apply)
13:11:35.519 STDOUT tofu:       + primary_web_microsoft_host         = (known after apply)
13:11:35.519 STDOUT tofu:       + public_network_access_enabled      = true
13:11:35.519 STDOUT tofu:       + queue_encryption_key_type          = "Service"
13:11:35.519 STDOUT tofu:       + resource_group_name                = "rg-tf-oppsamlingsregister-dev"
13:11:35.519 STDOUT tofu:       + secondary_access_key               = (sensitive value)
13:11:35.519 STDOUT tofu:       + secondary_blob_connection_string   = (sensitive value)
13:11:35.519 STDOUT tofu:       + secondary_blob_endpoint            = (known after apply)
13:11:35.519 STDOUT tofu:       + secondary_blob_host                = (known after apply)
13:11:35.519 STDOUT tofu:       + secondary_blob_internet_endpoint   = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_blob_internet_host       = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_blob_microsoft_endpoint  = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_blob_microsoft_host      = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_connection_string        = (sensitive value)
13:11:35.520 STDOUT tofu:       + secondary_dfs_endpoint             = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_dfs_host                 = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_dfs_internet_endpoint    = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_dfs_internet_host        = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_dfs_microsoft_endpoint   = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_dfs_microsoft_host       = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_file_endpoint            = (known after apply)
13:11:35.520 STDOUT tofu:       + secondary_file_host                = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_file_internet_endpoint   = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_file_internet_host       = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_file_microsoft_endpoint  = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_file_microsoft_host      = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_location                 = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_queue_endpoint           = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_queue_host               = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_queue_microsoft_endpoint = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_queue_microsoft_host     = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_table_endpoint           = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_table_host               = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_table_microsoft_endpoint = (known after apply)
13:11:35.521 STDOUT tofu:       + secondary_table_microsoft_host     = (known after apply)
13:11:35.522 STDOUT tofu:       + secondary_web_endpoint             = (known after apply)
13:11:35.522 STDOUT tofu:       + secondary_web_host                 = (known after apply)
13:11:35.522 STDOUT tofu:       + secondary_web_internet_endpoint    = (known after apply)
13:11:35.522 STDOUT tofu:       + secondary_web_internet_host        = (known after apply)
13:11:35.522 STDOUT tofu:       + secondary_web_microsoft_endpoint   = (known after apply)
13:11:35.522 STDOUT tofu:       + secondary_web_microsoft_host       = (known after apply)
13:11:35.522 STDOUT tofu:       + sftp_enabled                       = false
13:11:35.522 STDOUT tofu:       + shared_access_key_enabled          = true
13:11:35.522 STDOUT tofu:       + table_encryption_key_type          = "Service"
13:11:35.522 STDOUT tofu:       + tags                               = {
13:11:35.522 STDOUT tofu:           + "Environment" = "dev"
13:11:35.522 STDOUT tofu:           + "Owner"       = "dibk"
13:11:35.522 STDOUT tofu:           + "Project"     = "oppsamlingsregister"
13:11:35.522 STDOUT tofu:         }
13:11:35.522 STDOUT tofu:       + blob_properties {
13:11:35.522 STDOUT tofu:           + change_feed_enabled      = false
13:11:35.522 STDOUT tofu:           + default_service_version  = (known after apply)
13:11:35.522 STDOUT tofu:           + last_access_time_enabled = false
13:11:35.523 STDOUT tofu:           + versioning_enabled       = true
13:11:35.523 STDOUT tofu:           + delete_retention_policy {
13:11:35.523 STDOUT tofu:               + days                     = 30
13:11:35.523 STDOUT tofu:               + permanent_delete_enabled = false
13:11:35.523 STDOUT tofu:             }
13:11:35.523 STDOUT tofu:         }
13:11:35.523 STDOUT tofu:       + network_rules (known after apply)
13:11:35.523 STDOUT tofu:       + queue_properties (known after apply)
13:11:35.523 STDOUT tofu:       + routing (known after apply)
13:11:35.523 STDOUT tofu:       + share_properties (known after apply)
13:11:35.523 STDOUT tofu:       + static_website (known after apply)
13:11:35.523 STDOUT tofu:     }
13:11:35.523 STDOUT tofu:   # azurerm_storage_container.container["incoming"] will be created
13:11:35.523 STDOUT tofu:   + resource "azurerm_storage_container" "container" {
13:11:35.523 STDOUT tofu:       + container_access_type             = "private"
13:11:35.523 STDOUT tofu:       + default_encryption_scope          = (known after apply)
13:11:35.523 STDOUT tofu:       + encryption_scope_override_enabled = true
13:11:35.523 STDOUT tofu:       + has_immutability_policy           = (known after apply)
13:11:35.523 STDOUT tofu:       + has_legal_hold                    = (known after apply)
13:11:35.523 STDOUT tofu:       + id                                = (known after apply)
13:11:35.524 STDOUT tofu:       + metadata                          = (known after apply)
13:11:35.524 STDOUT tofu:       + name                              = "incoming"
13:11:35.524 STDOUT tofu:       + resource_manager_id               = (known after apply)
13:11:35.524 STDOUT tofu:       + storage_account_id                = (known after apply)
13:11:35.524 STDOUT tofu:     }
13:11:35.524 STDOUT tofu:   # azurerm_storage_container.container["logs"] will be created
13:11:35.524 STDOUT tofu:   + resource "azurerm_storage_container" "container" {
13:11:35.524 STDOUT tofu:       + container_access_type             = "private"
13:11:35.524 STDOUT tofu:       + default_encryption_scope          = (known after apply)
13:11:35.524 STDOUT tofu:       + encryption_scope_override_enabled = true
13:11:35.524 STDOUT tofu:       + has_immutability_policy           = (known after apply)
13:11:35.524 STDOUT tofu:       + has_legal_hold                    = (known after apply)
13:11:35.524 STDOUT tofu:       + id                                = (known after apply)
13:11:35.524 STDOUT tofu:       + metadata                          = (known after apply)
13:11:35.525 STDOUT tofu:       + name                              = "logs"
13:11:35.525 STDOUT tofu:       + resource_manager_id               = (known after apply)
13:11:35.525 STDOUT tofu:       + storage_account_id                = (known after apply)
13:11:35.525 STDOUT tofu:     }
13:11:35.525 STDOUT tofu:   # azurerm_storage_container.container["processed"] will be created
13:11:35.525 STDOUT tofu:   + resource "azurerm_storage_container" "container" {
13:11:35.525 STDOUT tofu:       + container_access_type             = "private"
13:11:35.525 STDOUT tofu:       + default_encryption_scope          = (known after apply)
13:11:35.525 STDOUT tofu:       + encryption_scope_override_enabled = true
13:11:35.525 STDOUT tofu:       + has_immutability_policy           = (known after apply)
13:11:35.525 STDOUT tofu:       + has_legal_hold                    = (known after apply)
13:11:35.525 STDOUT tofu:       + id                                = (known after apply)
13:11:35.525 STDOUT tofu:       + metadata                          = (known after apply)
13:11:35.525 STDOUT tofu:       + name                              = "processed"
13:11:35.525 STDOUT tofu:       + resource_manager_id               = (known after apply)
13:11:35.526 STDOUT tofu:       + storage_account_id                = (known after apply)
13:11:35.526 STDOUT tofu:     }
13:11:35.526 STDOUT tofu: Plan: 4 to add, 0 to change, 0 to destroy.
13:11:35.526 STDOUT tofu: 
13:11:35.916 STDOUT tofu: Releasing state lock. This may take a few moments...
```

</details>
    
